app/Http/Helpers/helpers.php

function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();
---
select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')

function get_user_notifications()
{
    if (auth()->check()) {

        $notifications = UserNotification::where('user_id', auth()->user()->id)
            ->latest('id')
            ->take(4)
            ->get();
---
select * from `user_notifications` where `user_id` = 3 order by `id` desc limit 4

function selectedLang()
{
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `status` = 1 limit 1

function pageEnable($slug)
{
    $page = SetupPage::where('slug',$slug)->first();
---
select * from `setup_pages` where `slug` = 'home' limit 1