app/Http/Controllers/Admin/Cars/CarAreaController.php

    public function index(){
        $page_title = __("Car Area");
        $car_area = CarArea::orderByDesc("id")->get();
---
select * from `car_areas` order by `id` desc

    public function edit($id){
        $area = CarArea::find($id);
        $car_types   = CarType::where('status',true)->get();
---
select * from `car_areas` where `car_areas`.`id` = '15' limit 1
select * from `car_types` where `status` = 1

    public function update(Request $request,$id)
    {
        $area     = CarArea::find($id);
        $validator = Validator::make($request->all(),[
            'name'        => 'required|string|max:80',
            'types'       => 'required|array',
            'types.*'     => 'required|integer',
        ]);

        if($validator->fails()) {
            return back()->withErrors($validator)->withInput();
        }

        $validated     = $validator->validate();
        $request_types = $validated['types'];

        $validated     = Arr::except($validated,['types']);


        $slug                        = Str::slug($validated['name']);
        $validated['slug']           = $slug;
        $validated['last_edit_by']   = auth()->user()->id;

        try{
            $area_type_ids = $area->types->pluck('id');

            AreaHasType::whereIn('id',$area_type_ids)->delete();
---
select * from `car_areas` where `car_areas`.`id` = '17' limit 1
delete from `area_has_types` where `id` in (121, 122, 123, 124, 125)

                        'created_at'   => now(),
                    ];
                }
                AreaHasType::insert($types);
---
insert into `area_has_types` (`car_area_id`, `car_type_id`, `created_at`) values (17, '1', '2024-08-18 21:28:48'), (17, '2', '2024-08-18 21:28:48'), (17, '3', '2024-08-18 21:28:48'), (17, '4', '2024-08-18 21:28:48'), (17, '5', '2024-08-18 21:28:48'), (17, '6', '2024-08-18 21:28:48')