app/Http/Controllers/Admin/Cars/CarController.php

select `cars`.`id`, `cars`.`car_area_id`, `cars`.`car_type_id`, `cars`.`slug`, `cars`.`car_model`, `cars`.`car_number`, `cars`.`seat`, `cars`.`experience`, `cars`.`fees`, `cars`.`image`, `cars`.`status`, MAX(car_bookings.status) as booking_status from `cars` inner join `car_bookings` on `cars`.`id` = `car_bookings`.`car_id` group by `cars`.`id`, `cars`.`car_area_id`, `cars`.`car_type_id`, `cars`.`slug`, `cars`.`car_model`, `cars`.`car_number`, `cars`.`seat`, `cars`.`experience`, `cars`.`fees`, `cars`.`image`, `cars`.`status`
select * from `cars` where not exists (select * from `car_bookings` where `cars`.`id` = `car_bookings`.`car_id`)
---
    public function index()
    {
        $page_title = __("Cars");

        $carsWithBookingStatus = Car::join('car_bookings', 'cars.id', '=', 'car_bookings.car_id')
            ->select('cars.id', 'cars.car_area_id', 'cars.car_type_id', 'cars.slug', 'cars.car_model', 'cars.car_number', 'cars.seat','cars.image', 'cars.status', DB::raw('MAX(car_bookings.status) as booking_status'))
            ->groupBy('cars.id', 'cars.car_area_id', 'cars.car_type_id', 'cars.slug', 'cars.car_model', 'cars.car_number', 'cars.seat','cars.image', 'cars.status')
            ->get();

        $carsWithoutBookings = Car::whereDoesntHave('bookings')->get();

select * from `car_areas` order by `name` asc
---
    public function create()
    {
        $page_title = __("Car Create");
        $car_area = CarArea::orderBy('name', 'ASC')->get();

select * from `car_areas` where `car_areas`.`id` = '7' limit 1
select * from `car_types` where `car_types`.`id` in (1, 2, 3) and `status` = 1
---
    public function getAreaTypes(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'area'  => 'required|integer',
        ]);
        if ($validator->fails()) {
            return Response::error($validator->errors()->all());
        }
        $area = CarArea::with(['types' => function ($type) {
            $type->with(['type'=> function($car_type){
                $car_type->where('status', true);
            }]);
        }])->find($request->area);

select * from `cars` where `cars`.`id` = '1' limit 1
select * from `car_areas` where `status` = 1 order by `name` asc
select * from `car_types` where `status` = 1
---
    public function edit($id)
    {
        $page_title = __("Car Edit");
        $cars  = Car::find($id);
        if (!$cars) return back()->with(['error' => [__("Car Does not exists")]]);

        $car_area = CarArea::where('status', true)->orderBy('name', 'ASC')->get();
        $car_type = CarType::where('status', true)->get();

select * from `cars` where `cars`.`id` = '1' limit 1
select exists(select * from `cars` where `car_number` = '2323') as `exists`
---
    public function update(Request $request, $id)
    {
        $car = Car::find($id);
        $validator = Validator::make($request->all(), [
            'area'        => 'required',
            'type'        => 'required',
            'car_model'   => 'required|string',
            'car_number'  => 'required|string|max:100',
            'seat'        => 'required|numeric',
            'experience'  => 'required|numeric',
            'fees'        => 'required|numeric',
            'image'       => 'nullable|image|mimes:png,jpg,jpeg,svg,webp',
        ]);

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput();
        }
        $validated                 = $validator->validate();
        $validated['slug']         = Str::uuid();
        $validated['car_area_id']  = $validated['area'];
        $validated['car_type_id']  = $validated['type'];

        if (Car::where('car_number', $validated['car_number'])->exists()) {