app/Http/Controllers/Admin/Cars/CarTypeController.php

    public function index(){
        $page_title = __("Car Types");
        $car_types = CarType::orderByDesc("id")->paginate(11);
---
select * from `car_types` order by `id` desc limit 11 offset 0
select count(*) as aggregate from `car_types`