app/Http/Controllers/Frontend/CarBookingController.php

    public function booking($slug,$car_name)
    {

        $area_from = CarArea::all();
        $area_to = CarArea::all();
        $page_title = setPageTitle(__("Car Booking"));
        $car = Car::where('slug', $slug)->first();

        if (!$car) abort(404);

        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();
        $validated_user = auth()->user();
        $about_slug = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $about = SiteSections::getData($about_slug)->first();
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $default = LanguageConst::NOT_REMOVABLE;
        $car_prices = CarPrice::all(); // Adjust this based on your actual column names
---
select * from `car_areas`
select * from `cars` where `slug` = 'f11449b8-f243-4bf3-82ef-0b1a117e4889' limit 1
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
select * from `car_prices`

    public function multibooking()
    {

        $area_from = CarArea::all();
        $area_to = CarArea::all();
        $page_title = setPageTitle(__("Car Booking"));
        $cars = Car::join('car_types', 'cars.car_type_id', '=', 'car_types.id')
            ->select('cars.id as car_id', 'cars.slug  as car_slug', 'car_types.id as car_type_id', 'car_types.name as car_type_name')
            ->get();
        if (!$cars) abort(404);
        // dd($cars);
        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();
        $validated_user = auth()->user();
        $about_slug = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $about = SiteSections::getData($about_slug)->first();
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $default = LanguageConst::NOT_REMOVABLE;
        $car_prices = CarPrice::all(); // Adjust this based on your actual column names
---
select * from `car_areas`
select `cars`.`id` as `car_id`, `cars`.`slug` as `car_slug`, `car_types`.`id` as `car_type_id`, `car_types`.`name` as `car_type_name` from `cars` inner join `car_types` on `cars`.`car_type_id` = `car_types`.`id`
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
select * from `car_prices`

    public function multifetchPrice(Request $request)
    {
        // استقبال name من الـ request
        $areaFromName = $request->input('area_from');
        $areaToName = $request->input('area_to');
        $slug = $request->input('car_id');

        // جلب id بناءً على name من جدول car_area
        $areaFrom = CarArea::where('name', $areaFromName)->first();
        $areaTo = CarArea::where('name', $areaToName)->first();

        if ($areaFrom && $areaTo) {
            // استخدام id في الاستعلام على جدول car_prices
            $car = Car::where('slug', $slug)->first(); // أو استخدام `firstOrFail` إذا كنت تريد إلقاء استثناء إذا لم يتم العثور على النتيجة
            // استخدام id في الاستعلام على جدول car_prices
            $price = CarPrice::where('from', $areaFrom->id)
                ->where('destination', $areaTo->id)
                ->where('car_id', $car->car_type_id)
                ->first();
---
select * from `car_areas` where `name` = 'المدينة المنورة' limit 1
select * from `cars` where `slug` = '7634561b-75bf-4e5b-9dcf-2e5d7fab6db0' limit 1
select * from `car_prices` where `from` = 8 and `destination` = 9 and `car_id` = 1 limit 1

    public function fetchPrice(Request $request)
    {
        // استقبال name من الـ request
        $areaFromName = $request->input('area_from');
        $areaToName = $request->input('area_to');
        $carId = $request->input('car_id');

        // جلب id بناءً على name من جدول car_area
        $areaFrom = CarArea::where('name', $areaFromName)->first();
        $areaTo = CarArea::where('name', $areaToName)->first();

        if ($areaFrom && $areaTo) {
            // استخدام id في الاستعلام على جدول car_prices
            $price = CarPrice::where('from', $areaFrom->id)
                ->where('destination', $areaTo->id)
                ->where('car_id', $carId)
                ->first();
---
select * from `car_prices` where `car_id` = '1' and `from` = '8' and `destination` = '9' limit 1