app/Http/Controllers/Frontend/HomeController.php

select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 order by `id` asc
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
---
    public function index(BasicSettingsProvider $basic_settings)
    {
        $page_title = $basic_settings->get()?->site_name . " | " . $basic_settings->get()?->site_title;
        $lang = selectedLang();
        $default = LanguageConst::NOT_REMOVABLE;
        $banner_slug = Str::slug(SiteSectionConst::BANNER_SECTION);
        $banner = SiteSections::getData($banner_slug)->first();
        $pattern = '/\[(.*?)\]/';
        preg_match($pattern, $banner->value->language->$lang->heading ?? $banner->value->language->$default->heading, $matches);
        $coloredText = isset($matches[1]) ? $matches[1] : '';
        $remainingText = str_replace("[$coloredText]", '', $banner->value->language->$lang->heading ?? $banner->value->language->$default->heading);

        $security_slug = Str::slug(SiteSectionConst::SECURITY_SECTION);
        $security = SiteSections::getData($security_slug)->first();

        $why_choose_us_slug = Str::slug(SiteSectionConst::WHY_CHOOSE_US_SECTION);
        $why_choose_us = SiteSections::getData($why_choose_us_slug)->first();

        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();

select * from `car_types` where `status` = 1
select `from` from `car_prices`
select * from `car_areas` where `id` in (19, 19, 19, 19, 19, 19, 19, 19, 19, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 19, 19, 19, 19, 19, 19, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 20, 20, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21) and `status` = 1
select `destination` from `car_prices`
select * from `car_areas` where `id` in (8, 8, 8, 7, 7, 7, 16, 16, 16, 8, 8, 8, 7, 7, 7, 16, 16, 16, 9, 9, 9, 19, 19, 19, 12, 12, 12, 9, 9, 9, 7, 7, 7, 8, 8, 8, 11, 11, 11, 17, 17, 17, 12, 12, 12, 20, 20, 20, 7, 7, 7, 8, 8, 8, 11, 11, 11, 17, 17, 17, 12, 12, 12, 8, 8, 8, 7, 7, 7, 10, 10, 10, 17, 17, 17, 18, 18, 18, 13, 13, 13, 14, 14, 14, 15, 15, 15, 9, 9, 21, 8, 8, 7, 7, 16, 16, 8, 8, 7, 7, 16, 16, 9, 9, 19, 19, 12, 12, 9, 9, 7, 7, 8, 8, 11, 11, 17, 17, 12, 12, 20, 20, 7, 7, 8, 8, 11, 11, 17, 17, 12, 12, 7, 7, 8, 8, 10, 10, 17, 17, 18, 18, 13, 13, 14, 14, 15, 15, 9, 9) and `status` = 1
select * from `car_types` where `car_types`.`id` in (1, 2, 3, 4)
select * from `app_settings` limit 1
---

        // يمكنك استخدام $carPrices في العرض أو لأي غرض آخر

        $car_types  = CarType::where('status', true)->get();
        // dd($car_types);
        // أولاً، نحتاج لجلب القيم من عمود 'from' في جدول 'CarPrice'
        $fromValues = CarPrice::pluck('from')->toArray();

        // ثم نستخدم القيم التي حصلنا عليها للبحث في جدول 'CarArea'
        $areas = CarArea::whereIn('id', $fromValues)
            ->where('status', true)
            ->get();
        $fromValues = CarPrice::pluck('destination')->toArray();
        // ثم نستخدم القيم التي حصلنا عليها للبحث في جدول 'CarArea'
        $areas_destination = CarArea::whereIn('id', $fromValues)
            ->where('status', true)
            ->get();
        $cars = Car::where('status', true)
            ->whereHas('type', function ($query) {
                $query->where('status', true);
            })
            ->whereHas('branch', function ($query) {
                $query->where('status', true);
            })
            ->where(function ($query) {
                $query->whereHas('bookings', function ($subquery) {
                    $subquery->where('status', '=', 3)->orWhere('status', '=', 1);
                })->orWhereDoesntHave('bookings');
            })
            ->with('type')
            ->get();

        $app_settings = AppSettings::first();

select * from `app_settings` limit 1
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
---
    public function aboutView()
    {
        $page_title = setPageTitle(__("About Us"));
        $about_slug = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $about = SiteSections::getData($about_slug)->first();
        $lang = selectedLang();
        $default = LanguageConst::NOT_REMOVABLE;
        $faq_slug = Str::slug(SiteSectionConst::FAQ_SECTION);
        $faq = SiteSections::getData($faq_slug)->first();
        $items = json_decode(json_encode($faq->value->items), true);
        $totalItems = count($items);
        $half = ceil($totalItems / 2);
        $app_slug = Str::slug(SiteSectionConst::APP_SECTION);
        $app = SiteSections::getData($app_slug)->first();
        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $app_settings = AppSettings::first();
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();

select `from` from `car_prices`
select * from `car_areas` where `id` in (19, 19, 19, 19, 19, 19, 19, 19, 19, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 19, 19, 19, 19, 19, 19, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 20, 20, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21) and `status` = 1
select `destination` from `car_prices`
select * from `car_areas` where `id` in (8, 8, 8, 7, 7, 7, 16, 16, 16, 8, 8, 8, 7, 7, 7, 16, 16, 16, 9, 9, 9, 19, 19, 19, 12, 12, 12, 9, 9, 9, 7, 7, 7, 8, 8, 8, 11, 11, 11, 17, 17, 17, 12, 12, 12, 20, 20, 20, 7, 7, 7, 8, 8, 8, 11, 11, 11, 17, 17, 17, 12, 12, 12, 8, 8, 8, 7, 7, 7, 10, 10, 10, 17, 17, 17, 18, 18, 18, 13, 13, 13, 14, 14, 14, 15, 15, 15, 9, 9, 21, 8, 8, 7, 7, 16, 16, 8, 8, 7, 7, 16, 16, 9, 9, 19, 19, 12, 12, 9, 9, 7, 7, 8, 8, 11, 11, 17, 17, 12, 12, 20, 20, 7, 7, 8, 8, 11, 11, 17, 17, 12, 12, 7, 7, 8, 8, 10, 10, 17, 17, 18, 18, 13, 13, 14, 14, 15, 15, 9, 9) and `status` = 1
select * from `car_types` where `status` = 1
---
    public function findCarView()
    {
        $page_title = setPageTitle(__("Find Car"));
        $default = LanguageConst::NOT_REMOVABLE;
        $cars = Car::where('status', true)
            ->whereHas('type', function ($query) {
                $query->where('status', true);
            })
            ->whereHas('branch', function ($query) {
                $query->where('status', true);
            })
            ->where(function ($query) {
                $query->whereHas('bookings', function ($subquery) {
                    $subquery->where('status', '=', 3)->orWhere('status', '=', 1);
                })->orWhereDoesntHave('bookings');
            })->get();
            $fromValues = CarPrice::pluck('from')->toArray();

            // ثم نستخدم القيم التي حصلنا عليها للبحث في جدول 'CarArea'
            $areas = CarArea::whereIn('id', $fromValues)
                ->where('status', true)
                ->get();
            $fromValues = CarPrice::pluck('destination')->toArray();
            // ثم نستخدم القيم التي حصلنا عليها للبحث في جدول 'CarArea'
            $areas_destination = CarArea::whereIn('id', $fromValues)
                ->where('status', true)
                ->get();
        // $areas = CarArea::where('status', true)->get();
        $types = CarType::where('status', true)->get();

select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 order by `id` asc
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
---
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();

select * from `app_settings` limit 1
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 order by `id` asc
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
---
    public function servicesView()
    {
        $page_title = setPageTitle(__("Services"));
        $lang = selectedLang();
        $default = LanguageConst::NOT_REMOVABLE;
        $service_slug = Str::slug(SiteSectionConst::SERVICE_SECTION);
        $service = SiteSections::getData($service_slug)->first();
        $app_slug = Str::slug(SiteSectionConst::APP_SECTION);
        $app = SiteSections::getData($app_slug)->first();
        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $app_settings = AppSettings::first();
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();

select * from `car_areas` where `car_areas`.`id` = '8' limit 1
select * from `car_types` where `car_types`.`id` in (1, 2, 3) and `status` = 1
---
    public function getAreaTypes(Request $request)
    {

        $validator    = Validator::make($request->all(), [
            'area'  => 'required|integer',
        ]);
        if ($validator->fails()) {
            return Response::error($validator->errors()->all());
        }
        $area = CarArea::with(['types' => function ($type) {
            $type->with(['type' => function ($car_type) {
                $car_type->where('status', true);
            }]);
        }])->find($request->area);

select * from `announcement` where `id` = '1' and `slug` = 'driving-safely-starluxury-commitment-to-your-security' limit 1
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 order by `id` asc
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
---
    public function blogDetailsView($id, $slug)
    {
        $page_title = setPageTitle(__("Blog Details"));
        $categories = AnnouncementCategory::active()->latest()->get();
        $lang = selectedLang();
        $default = LanguageConst::NOT_REMOVABLE;
        $announcement = Announcement::where('id', $id)->where('slug', $slug)->first();

        $recentPost = Announcement::active()->where('id', "!=", $id)->latest()->limit(3)->get();
        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();

select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 order by `id` asc
select * from `setup_pages` where `type` = 'useful-links' and `status` = 1 and `slug` = 'privacy-policy' order by `id` asc limit 1
select * from `setup_pages` where `slug` = 'privacy-policy' and `status` = 1 limit 1
---
    public function usefulPage($slug)
    {
        $footer_slug = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer = SiteSections::getData($footer_slug)->first();
        $type =  Str::slug(GlobalConst::USEFUL_LINKS);
        $auth_slug = Str::slug(SiteSectionConst::AUTH_SECTION);
        $auth = SiteSections::getData($auth_slug)->first();
        $policies = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->get();
        $policy = SetupPage::orderBy('id')->where('type', $type)->where('status', 1)->where('slug', 'privacy-policy')->first();
        $lang = selectedLang();
        $default = LanguageConst::NOT_REMOVABLE;
        $page = SetupPage::where('slug', $slug)->where('status', 1)->first();

select * from `languages` where `code` = 'ar' limit 1
---
    public function languageSwitch(Request $request)
    {
        $code = $request->target;
        $language = Language::where("code", $code)->first();