app/Http/Controllers/Admin/WebSettingsController.php

    public function basicSettings()
    {
        $page_title = __("Basic Settings");
        $basic_settings   = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function basicSettingsUpdate(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'base_color'        => 'required|string',
            'secondary_color'   => 'required|string',
            'country_code'      => 'nullable|string',
            'google_api_key'    => 'nullable|string',
            'web_version'       => 'required|string',
            'site_name'         => 'required|string',
            'site_title'        => 'required|string',
            'timezone'          => 'required|string',
            'otp_exp_seconds'   => 'required|string',
        ]);

        $validated = $validator->validate();

        $basic_settings = BasicSettings::first();
        if (!$basic_settings) return back()->with(['error' => [__('Basic settings not found!')]]);

        try {
            $basic_settings->update($validated);
---
select * from `basic_settings` limit 1
update `basic_settings` set `secondary_color` = '#243060', `basic_settings`.`updated_at` = '2024-08-18 23:05:51' where `id` = 1